# Apply Function

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(
    {
        "A" : [1,2,3,4,5],
        "B" : [10,20,30,40,50]
    }
)

In [3]:
df

   A   B
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50

- Syntax 
    - df_name.apply(function)

In [5]:
df.apply(np.square)

    A     B
0   1   100
1   4   400
2   9   900
3  16  1600
4  25  2500

In [6]:
df.apply(np.sqrt)

          A         B
0  1.000000  3.162278
1  1.414214  4.472136
2  1.732051  5.477226
3  2.000000  6.324555
4  2.236068  7.071068

In [8]:
x = lambda n : n ** 2
x(4)

16

In [9]:
df.apply(lambda n : n ** 2)

    A     B
0   1   100
1   4   400
2   9   900
3  16  1600
4  25  2500

In [11]:
df

   A   B
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50

In [10]:
df.apply(lambda n : n + 100)

     A    B
0  101  110
1  102  120
2  103  130
3  104  140
4  105  150

In [12]:
def func(n):
    return "Learning Apply Function"

In [13]:
df.apply(func)

A    Learning Apply Function
B    Learning Apply Function
dtype: object

In [14]:
def func(n):
    return n + n

df.apply(func)

    A    B
0   2   20
1   4   40
2   6   60
3   8   80
4  10  100

In [16]:
def func1(n):
    print(f"n = {n}")
    return n * 10

df["A"].apply(func1)

n = 1
n = 2
n = 3
n = 4
n = 5

0    10
1    20
2    30
3    40
4    50
Name: A, dtype: int64

In [17]:
def func2(n):
    return "DS"

df["B"] = df["B"].apply(func2)
df

   A   B
0  1  DS
1  2  DS
2  3  DS
3  4  DS
4  5  DS

In [18]:
df

   A   B
0  1  DS
1  2  DS
2  3  DS
3  4  DS
4  5  DS

In [20]:
df = pd.DataFrame(
    {
        "Country" : ["India","UK","USA"],
        "Capital" : ["Delhi","London","Washington DC"]
    }
)
df

  Country        Capital
0   India          Delhi
1      UK         London
2     USA  Washington DC

In [21]:
df["Capital"] = df["Capital"].apply(lambda ele : ele.lower())
df

  Country        Capital
0   India          delhi
1      UK         london
2     USA  washington dc

In [22]:
df["Capital"] = df["Capital"].apply(lambda ele : ele.upper())
df

  Country        Capital
0   India          DELHI
1      UK         LONDON
2     USA  WASHINGTON DC

In [23]:
df = pd.DataFrame(
    {
        "Country" : ["India","UK","USA"],
        "Capital" : ["Delhi #$%","London()*&^","Washington DC!@#$"]
    }
)
df

  Country            Capital
0   India          Delhi #$%
1      UK        London()*&^
2     USA  Washington DC!@#$

In [24]:
import string

In [26]:
letters = string.ascii_letters
letters += " "
letters

'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ '

In [27]:
new_ele = ""
for i in "Washington DC!@#$":
    if i in letters:
        new_ele += i
        
new_ele

'Washington DC'

In [28]:
def clean_data(ele):
    new_ele = ""
    for i in ele:
        if i in letters:
            new_ele += i
    return new_ele

In [29]:
df

  Country            Capital
0   India          Delhi #$%
1      UK        London()*&^
2     USA  Washington DC!@#$

In [30]:
df["Capital"] = df["Capital"].apply(clean_data)
df

  Country        Capital
0   India         Delhi
1      UK         London
2     USA  Washington DC

In [40]:
df = pd.DataFrame(
    {
        "Country" : ["India","UK","USA"],
        "Capital" : ["Delhi #$%","London()*&^","Washington DC!@#$"]
    }
)
df

  Country            Capital
0   India          Delhi #$%
1      UK        London()*&^
2     USA  Washington DC!@#$

In [41]:
import re
def clean_str(ele):
    ele = re.sub("[^A-Za-z]+","",ele)
    return ele

df["Capital"] = df["Capital"].apply(clean_str)
df

  Country       Capital
0   India         Delhi
1      UK        London
2     USA  WashingtonDC

In [42]:
df["Date"] = ["12-01-2021","30-12-2022","29-05-2022"]
df

  Country       Capital        Date
0   India         Delhi  12-01-2021
1      UK        London  30-12-2022
2     USA  WashingtonDC  29-05-2022

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Country  3 non-null      object
 1   Capital  3 non-null      object
 2   Date     3 non-null      object
dtypes: object(3)
memory usage: 200.0+ bytes

In [44]:
from datetime import datetime

def get_newdate(date_str):
    date_str = datetime.strptime(date_str,"%d-%m-%Y")
    return date_str

In [45]:
df["Datetime_date"] = df["Date"].apply(get_newdate)
df

  Country       Capital        Date Datetime_date
0   India         Delhi  12-01-2021    2021-01-12
1      UK        London  30-12-2022    2022-12-30
2     USA  WashingtonDC  29-05-2022    2022-05-29

In [46]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Country        3 non-null      object
 1   Capital        3 non-null      object
 2   Date           3 non-null      object
 3   Datetime_date  3 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(3)
memory usage: 224.0+ bytes